snlkuharlocal/src/Enums/ВидыДополнительныхОтчетовИОбработок/ВидыДополнительныхОтчетовИОбработок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДополнительныхОтчетовИОбработок</name>
  <enumValues>
    <name>ЗаполнениеОбъекта</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Catalogs/ВнешниеОтчеты/ВнешниеОтчеты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВнешниеОтчеты</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ПолныйПуть</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяФайла</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяТЧ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидОбработки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяФормы</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипОбъекта</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>УровеньДоступа</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СхемаКомпоновки</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользованиеЗапрещено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьПакетОтображаемыхДокументов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Удалено_Избранное</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОбработкиУпр</name>
    <type>
      <types>EnumRef.ВидыДополнительныхОтчетовИОбработок</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Роли</name>
    <attributes>
      <name>Роль</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Полномочия</name>
    <attributes>
      <name>Полномочие</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ПолномочияПользователей</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Пользователи</name>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Контрагенты</name>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

snlkuharlocal/src/CommonModules/ПодключаемыеКомандыВызовСервера/Module.bsl
#Область СлужебныеПроцедурыИФункции
#Область Общего_назначения


Функция ПолучитьСсылкуНаОбработку(ИмяКоманды, Префикс = "КомандаПечати_") Экспорт

	СтрокаГУИД = СтрЗаменить(ИмяКоманды, Префикс, "");
	СтрокаГУИД = СтрЗаменить(СтрокаГУИД, "_", "-");
	ВнешняяОбработкаСсылка = Справочники.ВнешниеОтчеты.ПолучитьСсылку(Новый УникальныйИдентификатор(СтрокаГУИД));

	Возврат ВнешняяОбработкаСсылка;

КонецФункции

Функция ПолучитьИмяДокументаДляФормыСписка(ЭтаФорма) Экспорт
	
	//Документ.ПриходнаяНакладная.Форма.ФормаСписка
	ИмяФормы = ЭтаФорма.ИмяФормы;

	МассивЧастиИмениФормы = СтрРазделить(ИмяФормы, ".");
	Если МассивЧастиИмениФормы.Количество() >= 2 Тогда
		Результат = МассивЧастиИмениФормы[1];
	Иначе
		Результат = Неопределено;
	КонецЕсли;

	Возврат Результат;

КонецФункции


Функция ПустаяСтруктураПараметры()

	Результат = Новый Структура;

	Результат.Вставить("ВидОбработки");
	Результат.Вставить("ИмяГруппыКнопок");
	Результат.Вставить("ЗаголовокГруппыКнопок");
	Результат.Вставить("КартинкаГруппыКнопок");
	Результат.Вставить("Префикс");
	Результат.Вставить("ИмяПроцедурыФормы");

	Возврат Результат;

КонецФункции

Процедура ДобавитьКомандыНаФорму(ОбъектСсылка, ЭтаФорма, ИмяГруппыКоманднаяПанель, Параметры)

	ПолноеИмяМД = ОбъектСсылка.Метаданные().ПолноеИмя();

	ИмяДокумента = ОбъектСсылка.Метаданные().Имя;

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВнешниеОтчеты_ИнтНазначения.Ссылка КАК Ссылка,
	|	ВнешниеОтчеты_ИнтНазначения.Ссылка.ВидОбработкиУпр КАК ВидОбработки,
	|	ВнешниеОтчеты_ИнтНазначения.Ссылка.Наименование КАК Наименование,
	|	ВнешниеОтчеты_ИнтНазначения.ИмяТЧ КАК ИмяТабличнойЧасти
	|ИЗ
	|	Справочник.ВнешниеОтчеты КАК ВнешниеОтчеты_ИнтНазначения
	|ГДЕ
	|	ВнешниеОтчеты_ИнтНазначения.ВидДокумента = &Назначение
	|	И ВнешниеОтчеты_ИнтНазначения.ВидОбработкиУпр В (&ВидыОбработки)
	|	И НЕ ВнешниеОтчеты_ИнтНазначения.ПометкаУдаления";

	Запрос.УстановитьПараметр("Назначение", ИмяДокумента);
	
	// один вид обработки
	Если ТипЗнч(Параметры.ВидОбработки) = Тип("ПеречислениеСсылка.ВидыДополнительныхОтчетовИОбработок") Тогда
		ВидыОбработки = Новый Массив;
		ВидыОбработки.Добавить(Параметры.ВидОбработки);
		
	// несколько видов обработки	
	ИначеЕсли ТипЗнч(Параметры.ВидОбработки) = Тип("Массив") Тогда
		ВидыОбработки = Параметры.ВидОбработки;
	КонецЕсли;

	Запрос.УстановитьПараметр("ВидыОбработки", ВидыОбработки);

	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	// создадим группу кнопок
	ГруппаКоманднаяПанель = ?(ЗначениеЗаполнено(ИмяГруппыКоманднаяПанель), ЭтаФорма.Элементы[ИмяГруппыКоманднаяПанель],
		ЭтаФорма.КоманднаяПанель);
	
	// проверим наличие элемента управления ГруппаКнопок и создадим его при необходимости
	Если ЭтаФорма.Элементы.Найти(Параметры.ИмяГруппыКнопок) = Неопределено Тогда
		ГруппаКнопок = ЭтаФорма.Элементы.Добавить(Параметры.ИмяГруппыКнопок, Тип("ГруппаФормы"), ГруппаКоманднаяПанель);
		ГруппаКнопок.Вид		= ВидГруппыФормы.Подменю;
		ГруппаКнопок.Заголовок	= Параметры.ЗаголовокГруппыКнопок;
		ГруппаКнопок.Картинка	= Параметры.КартинкаГруппыКнопок;
	Иначе
		ГруппаКнопок = ЭтаФорма.Элементы[Параметры.ИмяГруппыКнопок];
	КонецЕсли;
	
	// Если это подключаемый отчет, то создадим таблицу соответствия 
	//	*	ВнешнийОтчет_Инт, ИмяТабличнойЧасти, ПолеРезультат, ИспользованиеПараметра, ПолеОтбор, ВидСравнения
	// ПолеРезультат которое передается в подключаемый отчет
	// в зависимости от ИспользованиеПараметра - как ПараметрДанных или как ЭлементОтбора
	// если передается как ЭлементОтбора, то отбирается по полю ПолеОтбор
	Если ЭтоПодключаемыйОтчет(Параметры) Тогда		
		
	// если это заполнение объекта, то создадим таблицу соответствия ВнешнийОтчет_Инт и ИмяТабличнойЧасти	
	ИначеЕсли Параметры.ВидОбработки = Перечисления.ВидыДополнительныхОтчетовИОбработок.ЗаполнениеОбъекта Тогда
		ДобавитьРеквизитФормыТабличныеЧастиДляЗаполнения(ЭтаФорма);
	КонецЕсли;

	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		// добавляем команду формы
		ГУИД = Выборка.Ссылка.УникальныйИдентификатор();
		СтрокаГУИД = СтрЗаменить(Строка(ГУИД), "-", "_");

		НоваяКоманда = ЭтаФорма.Команды.Добавить(Параметры.Префикс + СтрокаГУИД);
		НоваяКоманда.Действие	= Параметры.ИмяПроцедурыФормы;
		НоваяКоманда.Заголовок	= Выборка.Наименование;
		
		// если указана ТЧ для команды заполнения объекта, то добавляем кнопки в командную панель табличной части
		Если Не ПустаяСтрока(Выборка.ИмяТабличнойЧасти) И Выборка.ВидОбработки
			= Перечисления.ВидыДополнительныхОтчетовИОбработок.ЗаполнениеОбъекта Тогда

			ИмяГруппыКоманднаяПанельТабЧасти	= Выборка.ИмяТабличнойЧасти + "КоманднаяПанель";
			ИмяГруппыКнопок						= Параметры.ИмяГруппыКнопок + Выборка.ИмяТабличнойЧасти;

			Если ЭтаФорма.Элементы.Найти(ИмяГруппыКнопок) = Неопределено Тогда
				ГруппаКнопок = ЭтаФорма.Элементы.Добавить(ИмяГруппыКнопок, Тип("ГруппаФормы"),
					ЭтаФорма.Элементы[ИмяГруппыКоманднаяПанельТабЧасти]);
				ГруппаКнопок.Вид		= ВидГруппыФормы.Подменю;
				ГруппаКнопок.Заголовок	= Параметры.ЗаголовокГруппыКнопок;
				ГруппаКнопок.Картинка	= Параметры.КартинкаГруппыКнопок;
			Иначе
				ГруппаКнопок = ЭтаФорма.Элементы[ИмяГруппыКнопок];
			КонецЕсли;

		КонецЕсли;
		
		// добавляем кнопку
		НоваяКнопка = ЭтаФорма.Элементы.Добавить(НоваяКоманда.Имя, Тип("КнопкаФормы"), ГруппаКнопок);
		НоваяКнопка.ИмяКоманды	= НоваяКоманда.Имя;
		
		// заполняем поля параметров для подключаемых отчетов
		Если ЭтоПодключаемыйОтчет(Параметры) Тогда
			НоваяСтр = ЭтаФорма.ПоляДляПодключаемыхОтчетов.Добавить();
			ЗаполняемыеКолонки = "Ссылка,ИмяТабличнойЧасти,ПолеПараметр,ИспользованиеПараметра,ПолеОтбор,ВидСравнения,ИмяВарианта";
			ЗаполнитьЗначенияСвойств(НоваяСтр, Выборка, ЗаполняемыеКолонки);
			
		// заполняемые твбличные части для обработок заполнения
		ИначеЕсли Параметры.ВидОбработки = Перечисления.ВидыДополнительныхОтчетовИОбработок.ЗаполнениеОбъекта Тогда
			НоваяСтр = ЭтаФорма.ТабличныеЧастиДляЗаполнения.Добавить();
			ЗаполняемыеКолонки = "Ссылка,ИмяТабличнойЧасти";
			ЗаполнитьЗначенияСвойств(НоваяСтр, Выборка, ЗаполняемыеКолонки);
		КонецЕсли;

	КонецЦикла;

КонецПроцедуры


Процедура ПриСозданииНаСервере(ОбъектСсылка, ЭтаФорма, ИмяГруппыКоманднаяПанель = Неопределено) Экспорт

	Если СтрНайти(ЭтаФорма.ИмяФормы, "ФормаСписка") = 0 Тогда
		ПриСозданииНаСервере_ЗаполнениеОбъекта(ОбъектСсылка, ЭтаФорма, ИмяГруппыКоманднаяПанель);
	КонецЕсли;

КонецПроцедуры

Функция ПодключитьДополнительнуюОбработку(ОбработкаСсылка) Экспорт
//
//	НавигационнаяСсылка = ПолучитьНавигационнуюСсылку(ОбработкаСсылка, "ХранилищеОбработки");
//
//	ОЗОД = Новый ОписаниеЗащитыОтОпасныхДействий;
//	ОЗОД.ПредупреждатьОбОпасныхДействиях = Ложь;
//  
	ПутьКФайлуНаСервере = ВернутьПолныйПутьКОбработке(ОбработкаСсылка);
	ДвоичныеДанные = Новый ДвоичныеДанные(ПутьКФайлуНаСервере); 
	АдресХранилища = ПоместитьВоВременноеХранилище(ДвоичныеДанные); 
	ИмяОбработки = ВнешниеОбработки.Подключить(АдресХранилища,,ложь);
   
			
	Возврат ИмяОбработки;

Возврат ""; 

КонецФункции

Функция ПодключитьДополнительнуюОбработкуЕвропа(ОбработкаСсылка) Экспорт//   
	
	//ИмяОбработки = ОбработкаСсылка.ИмяФайла; 
	//ИмяОбработки = СтрЗаменить(ИмяОбработки,"ВН_",""); 
	////только внешние
	//Если ОбработкаСсылка.ВидОбработкиУпр  = Перечисления.ВидыДополнительныхОтчетовИОбработок.ЗаполнениеОбъекта Тогда
	//	ДопКаталог="FillForms\";
	//Иначе 	
	//	ДопКаталог="";
	//КонецЕсли;

	//ИмяФайлаОбработки	=Константы.КаталогВнешнихОтчетов.Получить() + ДопКаталог + ИмяОбработки + ".epf";
	
	ИмяФайлаОбработки = ВернутьПолныйПутьКОбработке(ОбработкаСсылка); 
	ФайлОбработки		=Новый Файл(ИмяФайлаОбработки);
	Если ФайлОбработки.Существует() Тогда
		Возврат ВнешниеОбработки.Создать(ИмяФайлаОбработки);
	КонецЕсли;
		

КонецФункции

Функция ВернутьПолныйПутьКОбработке(ОбработкаСсылка) экспорт

	ИмяОбработки = ОбработкаСсылка.ИмяФайла; 
	ИмяОбработки = СтрЗаменить(ИмяОбработки,"ВН_",""); 
	//только внешние
	Если ОбработкаСсылка.ВидОбработкиУпр  = Перечисления.ВидыДополнительныхОтчетовИОбработок.ЗаполнениеОбъекта Тогда
		ДопКаталог="FillForms\";
	Иначе 	
		ДопКаталог="";
	КонецЕсли;

	ИмяФайлаОбработки	=Константы.КаталогВнешнихОтчетов.Получить() + ДопКаталог + ИмяОбработки + ".epf";
	
	Возврат ИмяФайлаОбработки; 

КонецФункции // ВернутьПолныйПутьКОбработке()


Функция ПолучитьОбъектДополнительнойОбработки(ОбработкаСсылка) Экспорт

//	ИмяОбработки = ПодключитьДополнительнуюОбработку(ОбработкаСсылка);
//	ОбработкаОбъект = ВнешниеОбработки.Создать(ИмяОбработки);
//
//	Возврат ОбработкаОбъект;

	Возврат ПодключитьДополнительнуюОбработкуЕвропа(ОбработкаСсылка); 

КонецФункции


Функция ЭтоПодключаемыйОтчет(Параметры)

	Возврат Ложь;

КонецФункции

#КонецОбласти

#Область Заполнение_объекта

Процедура ПриСозданииНаСервере_ЗаполнениеОбъекта(ОбъектСсылка, ЭтаФорма, ИмяГруппыКоманднаяПанель = Неопределено)

	Параметры = ПустаяСтруктураПараметры();

	Параметры.ВидОбработки			= Перечисления.ВидыДополнительныхОтчетовИОбработок.ЗаполнениеОбъекта;
	Параметры.ИмяГруппыКнопок		= "ГруппаКнопокЗаполнениеОбъекта";
	Параметры.ЗаголовокГруппыКнопок	= "Заполнить";
	Параметры.КартинкаГруппыКнопок	= БиблиотекаКартинок.РазвернутьВсе;
	Параметры.Префикс				= "ЗаполнениеОбъекта_";
	Параметры.ИмяПроцедурыФормы		= "ЗаполнениеОбъекта";

	ДобавитьКомандыНаФорму(ОбъектСсылка, ЭтаФорма, ИмяГруппыКоманднаяПанель, Параметры);

КонецПроцедуры


Процедура ДобавитьРеквизитФормыТабличныеЧастиДляЗаполнения(ЭтаФорма)

	ДобавляемыеРеквизиты = Новый Массив;

	РеквизитТаблица = Новый РеквизитФормы("ТабличныеЧастиДляЗаполнения", Новый ОписаниеТипов("ТаблицаЗначений"));

	ДобавляемыеРеквизиты.Добавить(РеквизитТаблица);

	РеквизитКолонка = Новый РеквизитФормы("Ссылка", Новый ОписаниеТипов("СправочникСсылка.ВнешниеОтчеты"),
		"ТабличныеЧастиДляЗаполнения");
	ДобавляемыеРеквизиты.Добавить(РеквизитКолонка);

	РеквизитКолонка = Новый РеквизитФормы("ИмяТабличнойЧасти", Новый ОписаниеТипов("Строка"),
		"ТабличныеЧастиДляЗаполнения");
	ДобавляемыеРеквизиты.Добавить(РеквизитКолонка);

	ЭтаФорма.ИзменитьРеквизиты(ДобавляемыеРеквизиты);

КонецПроцедуры


Функция ЗаполнениеОбъекта(ОбработкаСсылка, ОбъектСсылка, ИмяТабличнойЧасти) Экспорт
	ОбработкаОбъект = ПолучитьОбъектДополнительнойОбработки(ОбработкаСсылка);
	Возврат ОбработкаОбъект.ЗаполнениеОбъекта(ОбъектСсылка, ИмяТабличнойЧасти);
КонецФункции

 
Функция ПолучитьПараметрыЗаполнения(ОбработкаСсылка, ОбъектСсылка, ИмяТабличнойЧасти) Экспорт
	ОбработкаОбъект = ПолучитьОбъектДополнительнойОбработки(ОбработкаСсылка);
	Возврат ОбработкаОбъект.ПолучитьПараметрыЗаполнения(ОбъектСсылка, ИмяТабличнойЧасти);
КонецФункции


Функция ТребуетсяОткрыватьФормуОбработкиЗаполнения(ОбработкаСсылка) Экспорт
	ОбработкаОбъект = ПолучитьОбъектДополнительнойОбработки(ОбработкаСсылка);
	Возврат ОбработкаОбъект.ТребуетсяОткрыватьФормуОбработки();
КонецФункции


Функция ПолучитьНастройкиОбработкиЗаполнения(ОбработкаСсылка) Экспорт
	Настройки = ХранилищеОбщихНастроек.Загрузить(ПолучитьКлючНастроек(ОбработкаСсылка), , , ИмяПользователя());
	Возврат Настройки;
КонецФункции


Процедура ЗаписатьНастройкиОбработкиЗаполнения(ОбработкаСсылка, АдресНастроек) Экспорт

	Если ПустаяСтрока(АдресНастроек) Или Не ЭтоАдресВременногоХранилища(АдресНастроек) Тогда
		Возврат;
	КонецЕсли;
	
	// настройки, с которыми выполнено заполнение
	Настройки = ПолучитьИзВременногоХранилища(АдресНастроек);
	ХранилищеОбщихНастроек.Сохранить(ПолучитьКлючНастроек(ОбработкаСсылка), , Настройки, , ИмяПользователя());

КонецПроцедуры

Функция ПолучитьКлючНастроек(ОбработкаСсылка)
	ГУИД = ОбработкаСсылка.УникальныйИдентификатор();
	СтрокаГУИД = СтрЗаменить(Строка(ГУИД), "-", "_");
	КлючНастроек = "ЗаполнениеОбъектов/" + ОбработкаСсылка.Наименование + "/" + СтрокаГУИД;
	Возврат КлючНастроек;
КонецФункции

#КонецОбласти

#Область Заполнение_объекта_Форма


Процедура ПриСозданииНаСервере_ФормаЗаполнениеОбъекта(ЭтаФорма, Отказ, СтандартнаяОбработка) Экспорт
	
	// добавляем на форму необходимые реквизиты и элементы управления
	ДобавитьРеквизитыЭлементыФормы(ЭтаФорма);

	СхемаКомпоновкиДанных = ЭтаФорма.РеквизитФормыВЗначение("Объект").ПолучитьМакет("СхемаКомпоновкиДанных");
	
	// параметры данных для СКД
	//ПараметрыЗаполнения		= ОбщегоНазначения.ПолучитьЗначениеПараметра(ЭтаФорма.Параметры,"ПараметрыЗаполнения",Новый Структура);
	//Для Каждого КлючЗначение Из ЭтаФорма.Параметры.ПараметрыЗаполнения Цикл
	//	ПараметрыЗаполнения.Вставить(КлючЗначение.Ключ, КлючЗначение.Значение);
	//КонецЦикла;
	ЭтаФорма.ПараметрыЗаполнения 		= ОбщегоНазначенияС.ПолучитьЗначениеПараметра(ЭтаФорма.Параметры,
		"ПараметрыЗаполнения", Новый Структура);

	ЭтаФорма.АдресСхемыКомпоновкиДанных = ПоместитьВоВременноеХранилище(СхемаКомпоновкиДанных,
		ЭтаФорма.УникальныйИдентификатор);

	ЭтаФорма.КомпоновщикНастроек.Инициализировать(
		Новый ИсточникДоступныхНастроекКомпоновкиДанных(ЭтаФорма.АдресСхемыКомпоновкиДанных));
	
	// пытаемся взять настройки, сохраненные в базе
	ТекНастройки = Неопределено;
	ЭтаФорма.Параметры.Свойство("НастройкиЗаполнения", ТекНастройки);

	Если ТекНастройки = Неопределено Тогда
		// если сохраненных настроек нет, то берем настройки по умолчанию из СхемыКомпоновкиДанных
		ТекНастройки = СхемаКомпоновкиДанных.НастройкиПоУмолчанию;
	Иначе
		// добавим выбранные поля из СКД
		ТекНастройки.Выбор.Элементы.Очистить();
		Для Каждого ВыбранноеПоле Из СхемаКомпоновкиДанных.НастройкиПоУмолчанию.Выбор.Элементы Цикл
			ТипЗначенияВыбранногоПоля = ТипЗнч(ВыбранноеПоле);
			Если ТипЗначенияВыбранногоПоля = Тип("ВыбранноеПолеКомпоновкиДанных") Тогда
				НовоеПоле = ТекНастройки.Выбор.Элементы.Добавить(ТипЗначенияВыбранногоПоля);
				НовоеПоле.Использование		= Истина;
				НовоеПоле.Поле				= ВыбранноеПоле.Поле;
				НовоеПоле.РежимОтображения	= РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;

	ЭтаФорма.КомпоновщикНастроек.ЗагрузитьНастройки(ТекНастройки);

	ЭтаФорма.ЗакрыватьПриВыборе = Истина;

КонецПроцедуры

Процедура ДобавитьРеквизитыЭлементыФормы(ЭтаФорма) Экспорт
	
	//////////////////////////////////////////////////////////////////
	// добавим необходимые реквизиты формы
	ДобавляемыеРеквизиты = Новый Массив;
	
	// адрес во временном хранилище, по которому лежит СКД
	АдресСхемыКомпоновкиДанных = Новый РеквизитФормы("АдресСхемыКомпоновкиДанных", Новый ОписаниеТипов("Строка"));
	ДобавляемыеРеквизиты.Добавить(АдресСхемыКомпоновкиДанных);
	
	// адрес во временном хранилище, по которому лежат настройки
	АдресНастроек = Новый РеквизитФормы("АдресНастроек", Новый ОписаниеТипов("Строка"));
	ДобавляемыеРеквизиты.Добавить(АдресНастроек);
	
	// параметры данных для СКД, структура;
	ПараметрыЗаполнения = Новый РеквизитФормы("ПараметрыЗаполнения", Новый ОписаниеТипов);
	ДобавляемыеРеквизиты.Добавить(ПараметрыЗаполнения);

	ЭтаФорма.ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	
	//////////////////////////////////////////////////////////////////
	// добавим команды формы

	КомандаЗаполнить = ЭтаФорма.Команды.Добавить("Заполнить");
	КомандаЗаполнить.Действие	= "Заполнить";
	КомандаЗаполнить.Заголовок	= "Заполнить";

	КомандаОтмена = ЭтаФорма.Команды.Добавить("Отмена");
	КомандаОтмена.Действие		= "Отмена";
	КомандаОтмена.Заголовок		= "Отмена";
	
	//////////////////////////////////////////////////////////////////
	// добавим элементы управления

	КнопкаЗаполнить = ЭтаФорма.Элементы.Добавить("ФормаЗаполнить", Тип("КнопкаФормы"), ЭтаФорма.КоманднаяПанель);
	КнопкаЗаполнить.ИмяКоманды								= "Заполнить";
	КнопкаЗаполнить.КнопкаПоУмолчанию						= Истина;

	КнопкаОтмена = ЭтаФорма.Элементы.Добавить("ФормаОтмена", Тип("КнопкаФормы"), ЭтаФорма.КоманднаяПанель);
	КнопкаОтмена.ИмяКоманды									= "Отмена";
	
	////КомпоновщикНастроекНастройкиОтбор = ЭтаФорма.Элементы.Добавить("КомпоновщикНастроекНастройкиОтбор", Тип("ТаблицаФормы"), ЭтаФорма);
	////КомпоновщикНастроекНастройкиОтбор.ПутьКДанным 			= "КомпоновщикНастроек.Настройки.Отбор";
	////КомпоновщикНастроекНастройкиОтбор.ПоложениеЗаголовка	= ПоложениеЗаголовкаЭлементаФормы.Нет;

КонецПроцедуры


Функция ПолучитьТаблицуДанныеЗаполнения(ЭтаФорма) Экспорт

	СхемаКомпоновкиДанных = ПолучитьИзВременногоХранилища(ЭтаФорма.АдресСхемыКомпоновкиДанных);	
	
	// заполним параметры
	Для Каждого ЭлементПараметра Из ЭтаФорма.ПараметрыЗаполнения Цикл
		РаботаНадСКД_КС.УстановитьПараметрДанных(ЭтаФорма.КомпоновщикНастроек, ЭлементПараметра.Ключ,
			ЭлементПараметра.Значение);
	КонецЦикла;

	Настройки = ЭтаФорма.КомпоновщикНастроек.ПолучитьНастройки();
	
	// сохраним во временном хранилище настройки, с которыми заполняли. В компоновщике настройки сбиваются после возвращения на клиент
	ЭтаФорма.АдресНастроек = ПоместитьВоВременноеХранилище(Настройки, ЭтаФорма.УникальныйИдентификатор);
		
	//Помещаем в переменную данные о расшифровке данных
	ДанныеРасшифровки = Новый ДанныеРасшифровкиКомпоновкиДанных;
	
	//Формируем макет, с помощью компоновщика макета
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	
	//Передаем в макет компоновки схему, настройки и данные расшифровки
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, Настройки, ДанныеРасшифровки, , Тип(
		"ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	
	//Выполним компоновку с помощью процессора компоновки
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки, , ДанныеРасшифровки);

	ТаблицаРезультат = Новый ТаблицаЗначений;
	
	//Выводим результат в табличный документ
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	ПроцессорВывода.УстановитьОбъект(ТаблицаРезультат);

	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);

	Возврат ТаблицаРезультат;

КонецФункции

#КонецОбласти
#КонецОбласти
